ARMmbed/mbed-os/targets/TARGET_MICROCHIP/TARGET_PIC32CX/device/pic32cx2051mtc100_0.h
/*
 * \brief CMSIS includes
 */

#include <core_cm4.h>
#if !defined DONT_USE_CMSIS_INIT
#include "system_pic32cx.h"
#endif /* DONT_USE_CMSIS_INIT */

/*@}*/

/* ************************************************************************** */
/**  SOFTWARE PERIPHERAL API DEFINITION FOR PIC32CX2051MTC100 */
/* ************************************************************************** */
/** \addtogroup PIC32CX2051MTC100_api Peripheral Software API */
/*@{*/

#include "component/acc.h"
#include "component/adc.h"
#include "component/aes.h"
#include "component/aesb.h"
#include "component/chipid.h"
#include "component/cmcc.h"
#include "component/cpkcc.h"
#include "component/dwdt.h"
#include "component/emafelpfif.h"
#include "component/flexcom.h"
#include "component/gpbr.h"
#include "component/icm.h"
#include "component/ipc.h"
#include "component/matrix.h"
#include "component/mcspi.h"
#include "component/mem2mem.h"
#include "component/pdc.h"
#include "component/pio.h"
#include "component/pmc.h"
#include "component/pwm.h"
#include "component/qspi.h"
#include "component/rstc.h"
#include "component/rtc.h"
#include "component/rtt.h"
#include "component/sefc.h"
#include "component/sfr.h"
#include "component/sfrbu.h"
#include "component/sha.h"
#include "component/slcdc.h"
#include "component/spi.h"
#include "component/supc.h"
#include "component/syscwp.h"
#include "component/tc.h"
#include "component/trng.h"
#include "component/twi.h"
#include "component/uart.h"
#include "component/usart.h"
/*@}*/

/* ************************************************************************** */
/*   REGISTER ACCESS DEFINITIONS FOR PIC32CX2051MTC100 */
/* ************************************************************************** */
/** \addtogroup PIC32CX2051MTC100_reg Registers Access Definitions */
/*@{*/

#include "instance/flexcom0.h"
#include "instance/flexcom1.h"
#include "instance/flexcom2.h"
#include "instance/flexcom3.h"
#include "instance/flexcom4.h"
#include "instance/flexcom5.h"
#include "instance/flexcom6.h"
#include "instance/flexcom7.h"
#include "instance/usart0.h"
#include "instance/usart1.h"
#include "instance/usart2.h"
#include "instance/usart3.h"
#include "instance/usart4.h"
#include "instance/usart5.h"
#include "instance/usart6.h"
#include "instance/usart7.h"
#include "instance/spi0.h"
#include "instance/spi1.h"
#include "instance/spi2.h"
#include "instance/spi3.h"
#include "instance/spi4.h"
#include "instance/spi5.h"
#include "instance/spi6.h"
#include "instance/spi7.h"
#include "instance/twi0.h"
#include "instance/twi1.h"
#include "instance/twi2.h"
#include "instance/twi3.h"
#include "instance/twi4.h"
#include "instance/twi5.h"
#include "instance/twi6.h"
#include "instance/twi7.h"
#include "instance/qspi.h"
#include "instance/adc.h"
#include "instance/acc.h"
#include "instance/ipc0.h"
#include "instance/slcdc.h"
#include "instance/mem2mem0.h"
#include "instance/tc0.h"
#include "instance/tc1.h"
#include "instance/tc2.h"
#include "instance/matrix1.h"
#include "instance/pio.h"
#include "instance/chipid.h"
#include "instance/sfr.h"
#include "instance/sfrbu.h"
#include "instance/dwdt.h"
#include "instance/rstc.h"
#include "instance/rtt.h"
#include "instance/gpbr.h"
#include "instance/rtc.h"
#include "instance/syscwp.h"
#include "instance/supc.h"
#include "instance/aes.h"
#include "instance/aesb.h"
#include "instance/sha.h"
#include "instance/trng.h"
#include "instance/icm.h"
#include "instance/cpkcc.h"
#include "instance/matrix0.h"
#include "instance/cmcc0.h"
#include "instance/cmcc1.h"
#include "instance/sefc0.h"
#include "instance/sefc1.h"
#include "instance/pmc.h"
#include "instance/mem2mem1.h"
#include "instance/tc3.h"
#include "instance/uart.h"
#include "instance/ipc1.h"
#include "instance/mcspi.h"
#include "instance/pwm.h"
#include "instance/matrix3.h"
#include "instance/matrix2.h"
/*@}*/

/* ************************************************************************** */
/*   PERIPHERAL ID DEFINITIONS FOR PIC32CX2051MTC100 */
/* ************************************************************************** */
/** \addtogroup PIC32CX2051MTC100_id Peripheral Ids Definitions */
/*@{*/

#define ID_SUPC         ( 0) /**< \brief Supply Controller (SUPC) */
#define ID_RSTC         ( 1) /**< \brief Reset Controller (RSTC) */
#define ID_RTC          ( 2) /**< \brief Real Time Clock (RTC) */
#define ID_RTT          ( 3) /**< \brief Real Time Timer (RTT) */
#define ID_DWDT         ( 4) /**< \brief Dual Watchdog Timer (DWDT) */
#define ID_PMC          ( 6) /**< \brief Power Management Controller (PMC) */
#define ID_SEFC0        ( 7) /**< \brief Embedded Flash Controller 0 (SEFC0) */
#define ID_SEFC1        ( 8) /**< \brief Embedded Flash Controller 1 (SEFC1) */
#define ID_FLEXCOM0     ( 9) /**< \brief FLEXCOM 0 (USART0/SPI0/TWI0) (FLEXCOM0) */
#define ID_FLEXCOM1     (10) /**< \brief FLEXCOM 1 (USART1/SPI1/TWI1) (FLEXCOM1) */
#define ID_FLEXCOM2     (11) /**< \brief FLEXCOM 2 (USART2/SPI2/TWI2) (FLEXCOM2) */
#define ID_FLEXCOM3     (12) /**< \brief FLEXCOM 3 (USART3/SPI3/TWI3) (FLEXCOM3) */
#define ID_FLEXCOM4     (13) /**< \brief FLEXCOM 4 (USART4/SPI4/TWI4) (FLEXCOM4) */
#define ID_FLEXCOM5     (14) /**< \brief FLEXCOM 5 (USART5/SPI5/TWI5) (FLEXCOM5) */
#define ID_FLEXCOM6     (15) /**< \brief FLEXCOM 6 (USART6/SPI6/TWI6) (FLEXCOM6) */
#define ID_FLEXCOM7     (16) /**< \brief FLEXCOM 7 (USART7/SPI7/TWI7) (FLEXCOM7) */
#define ID_PIOA         (17) /**< \brief Application Core Parallel I/O Controller A (PIOA) (PIOA) */
#define ID_PIOA_SEC     (18) /**< \brief Application Core Parallel I/O Controller A (PIOA) Secure Event Interrupt (PIOA_SEC) */
#define ID_PIOB         (19) /**< \brief Application Core Parallel I/O Controller (B PIOB) (PIOB) */
#define ID_PIOB_SEC     (20) /**< \brief Application Core Parallel I/O Controller (B PIOB) Secure Event Interrupt (PIOB_SEC) */
#define ID_PIOC         (21) /**< \brief Application Core Parallel I/O Controller C (PIOC) (PIOC) */
#define ID_PIOC_SEC     (22) /**< \brief Application Core Parallel I/O Controller C (PIOC) Secure Event Interrupt (PIOC_SEC) */
#define ID_QSPI         (23) /**< \brief Quad IO Serial Peripheral Interface (QSPI) */
#define ID_ADC          (24) /**< \brief Analog To Digital Converter (ADC) */
#define ID_ACC          (25) /**< \brief Analog Comparator (ACC) */
#define ID_ARM0_FPU     (26) /**< \brief Application Core (CORE0) Floating Point Unit except IXC (ARM0_FPU) */
#define ID_ARM0_IXC     (27) /**< \brief Application Core (CORE0) FPU Interrupt IXC associated with FPU cumulative exception bit (ARM0_IXC) */
#define ID_IPC0         (28) /**< \brief Application Core Interprocessor communication (IPC0) (IPC0) */
#define ID_SLCDC        (29) /**< \brief Segment LCD Controller (SLCDC) */
#define ID_MEM2MEM0     (30) /**< \brief Application Core Memory to Memory Transfer Controller (MEM2MEM0) (MEM2MEM0) */
#define ID_TC0_CHANNEL0 (31) /**< \brief Timer Counter 0, Channel 0 (TC0_CHANNEL0) */
#define ID_TC0_CHANNEL1 (32) /**< \brief Timer Counter 0, Channel 1 (TC0_CHANNEL1) */
#define ID_TC0_CHANNEL2 (33) /**< \brief Timer Counter 0, Channel 2 (TC0_CHANNEL2) */
#define ID_TC1_CHANNEL0 (34) /**< \brief Timer Counter 1, Channel 0 (TC1_CHANNEL0) */
#define ID_TC1_CHANNEL1 (35) /**< \brief Timer Counter 1, Channel 1 (TC1_CHANNEL1) */
#define ID_TC1_CHANNEL2 (36) /**< \brief Timer Counter 1, Channel 2 (TC1_CHANNEL2) */
#define ID_TC2_CHANNEL0 (37) /**< \brief Timer Counter 2, Channel 0 (TC2_CHANNEL0) */
#define ID_TC2_CHANNEL1 (38) /**< \brief Timer Counter 2, Channel 1 (TC2_CHANNEL1) */
#define ID_TC2_CHANNEL2 (39) /**< \brief Timer Counter 2, Channel 2 (TC2_CHANNEL2) */
#define ID_TC0_C0SEC    (40) /**< \brief Timer Counter 0, Channel 0, Secure IRQ (TC0_C0SEC) */
#define ID_TC0_C1SEC    (41) /**< \brief Timer Counter 0, Channel 1, Secure IRQ (TC0_C1SEC) */
#define ID_TC0_C2SEC    (42) /**< \brief Timer Counter 0, Channel 2, Secure IRQ (TC0_C2SEC) */
#define ID_TC1_C0SEC    (43) /**< \brief Timer Counter 1, Channel 0, Secure IRQ (TC1_C0SEC) */
#define ID_TC1_C1SEC    (44) /**< \brief Timer Counter 1, Channel 1, Secure IRQ (TC1_C1SEC) */
#define ID_TC1_C2SEC    (45) /**< \brief Timer Counter 1, Channel 2, Secure IRQ (TC1_C2SEC) */
#define ID_TC2_C0SEC    (46) /**< \brief Timer Counter 2, Channel 0, Secure IRQ (TC2_C0SEC) */
#define ID_TC2_C1SEC    (47) /**< \brief Timer Counter 2, Channel 1, Secure IRQ (TC2_C1SEC) */
#define ID_TC2_C2SEC    (48) /**< \brief Timer Counter 2, Channel 2, Secure IRQ (TC2_C2SEC) */
#define ID_AES          (49) /**< \brief Advanced Enhanced Standard (AES) */
#define ID_AES_AESSEC   (50) /**< \brief AES Secure Event Interrupt (AES_AESSEC) */
#define ID_AESB         (51) /**< \brief AES Bridge (AESB) */
#define ID_AESB_AESBSEC (52) /**< \brief AES Bridge Secure Interrupt (AESB_AESBSEC) */
#define ID_SHA          (53) /**< \brief Secure Hash Algorithm (SHA) */
#define ID_SHA_SHASEC   (54) /**< \brief SHA Secure Event Interrupt (SHA_SHASEC) */
#define ID_TRNG         (55) /**< \brief True Random Generator (TRNG) */
#define ID_TRNG_TRNGSEC (56) /**< \brief TRNG Secure Event Interrupt (TRNG_TRNGSEC) */
#define ID_ICM          (57) /**< \brief Integrity Check Module (ICM) */
#define ID_ICM_ICMSEC   (58) /**< \brief Integrity Check Module (ICM_ICMSEC) */
#define ID_CPKCC        (59) /**< \brief Public Key Cryptography Controller (CPKCC) */
#define ID_MATRIX0      (60) /**< \brief High-Speed Application Core Matrix (HSACM) (MATRIX0) (MATRIX0) */
#define ID_MATRIX1      (61) /**< \brief Low-Speed Application Core Matrix (LSACM) (MATRIX1) (MATRIX1) */
#define ID_SUPC_WKUP3   (62) /**< \brief External interrupt 3 (SUPC_WKUP3) */
#define ID_SUPC_WKUP4   (63) /**< \brief External interrupt 4 (SUPC_WKUP4) */
#define ID_SUPC_WKUP5   (64) /**< \brief External interrupt 5 (SUPC_WKUP5) */
#define ID_SUPC_WKUP6   (65) /**< \brief External interrupt 6 (SUPC_WKUP6) */
#define ID_SUPC_WKUP7   (66) /**< \brief External interrupt 7 (SUPC_WKUP7) */
#define ID_SUPC_WKUP8   (67) /**< \brief External interrupt 8 (SUPC_WKUP8) */
#define ID_SUPC_WKUP9   (68) /**< \brief External interrupt 9 (SUPC_WKUP9) */
#define ID_SUPC_WKUP10  (69) /**< \brief External interrupt 10 (SUPC_WKUP10) */
#define ID_SUPC_WKUP11  (70) /**< \brief External interrupt 11 (SUPC_WKUP11) */
#define ID_SUPC_WKUP12  (71) /**< \brief External interrupt 12 (SUPC_WKUP12) */
#define ID_SUPC_WKUP13  (72) /**< \brief External interrupt 13 (SUPC_WKUP13) */
#define ID_SUPC_WKUP14  (73) /**< \brief External interrupt 14 (SUPC_WKUP14) */
#define ID_SUPC_WKUP15  (74) /**< \brief External interrupt 15 (SUPC_WKUP15) */
#define ID_SEAFEC       (75) /**< \brief Smart Energy Analog Front-End Controller (SEAFEC) */
#define ID_SEAFEC_SLINK (76) /**< \brief Smart Energy Analog Front-End Controller Serial Link Interrupt (SEAFEC_SLINK) */
#define ID_SEAFEC_DATA  (77) /**< \brief Smart Energy Analog Front-End Controller Data Ready Interrupt (SEAFEC_DATA) */
#define ID_MEM2MEM1     (78) /**< \brief Metrology Core Memory to Memory Transfer Controller 1 (MEM2MEM1) (MEM2MEM1) */
#define ID_TC3_CHANNEL0 (79) /**< \brief Timer Counter 3, Channel 0 (TC3_CHANNEL0) */
#define ID_TC3_CHANNEL1 (80) /**< \brief Timer Counter 3, Channel 1 (TC3_CHANNEL1) */
#define ID_TC3_CHANNEL2 (81) /**< \brief Timer Counter 3, Channel 2 (TC3_CHANNEL2) */
#define ID_TC3_C0SEC    (82) /**< \brief Timer Counter 3, Channel 0, Secure IRQ (TC3_C0SEC) */
#define ID_TC3_C1SEC    (83) /**< \brief Timer Counter 3, Channel 1, Secure IRQ (TC3_C1SEC) */
#define ID_TC3_C2SEC    (84) /**< \brief Timer Counter 3, Channel 2, Secure IRQ (TC3_C2SEC) */
#define ID_PIOD         (85) /**< \brief Metrology Core Parallel I/O Controller D (PIOD) (PIOD) */
#define ID_PIOD_SEC     (86) /**< \brief Metrology Core Parallel I/O Controller A Secure Interupt (named as PIOD) (PIOD_SEC) */
#define ID_UART         (87) /**< \brief Optical UART (UART) */
#define ID_IPC1         (88) /**< \brief Metrology Core Interprocessor communication (IPC1) (IPC1) */
#define ID_MCSPI        (89) /**< \brief Multi-Channel SPI (MCSPI) */
#define ID_PWM          (90) /**< \brief Pulse Width Modulation (PWM) */
#define ID_FLEXRAM1     (91) /**< \brief Metrology Core RAM (FLEXRAM 1 & 2) (FLEXRAM1) */
#define ID_ARM1_FPU     (92) /**< \brief Metrology Core (CORE1) Floating Point Unit except IXC (ARM1_FPU) */
#define ID_ARM1_IXC     (93) /**< \brief Metrology Core (CORE1) FPU Interrupt IXC associated with FPU cumulative exception bit (ARM1_IXC) */
#define ID_MATRIX2      (94) /**< \brief High-Speed Metrology Core Matrix (HSMCM) (Formely MATRIX2) (MATRIX2) */
#define ID_MATRIX3      (95) /**< \brief Low-Speed Metrology Core Matrix (LSMCM) (Formely MATRIX3) (MATRIX3) */

#define ID_PERIPH_COUNT (97) /**< \brief Number of peripheral IDs */
/*@}*/

/* ************************************************************************** */
/*   BASE ADDRESS DEFINITIONS FOR PIC32CX2051MTC100 */
/* ************************************************************************** */
/** \addtogroup PIC32CX2051MTC100_base Peripheral Base Address Definitions */
/*@{*/

